
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 14 to add, 0 to change, 15 to destroy.</code></pre>

* Delete
  * azurerm_key_vault_secret.civil_secrets[&#34;civil-citizen-ui-token-key&#34;]
* Replace
  * azurerm_key_vault_secret.app_insights_connection_string
  * azurerm_key_vault_secret.app_insights_instrumentation_key
  * azurerm_key_vault_secret.civil_secrets[&#34;citizen-ui-idam-secret&#34;]
  * azurerm_key_vault_secret.civil_secrets[&#34;ordnance-survey-api-key&#34;]
  * azurerm_key_vault_secret.cmc_secrets[&#34;citizen-draft-store-primary&#34;]
  * azurerm_key_vault_secret.cmc_secrets[&#34;citizen-draft-store-secondary&#34;]
  * azurerm_key_vault_secret.cmc_secrets[&#34;cmc-s2s-secret&#34;]
  * azurerm_key_vault_secret.redis_draft_store_access_key
  * module.key-vault.azurerm_key_vault.kv
  * module.key-vault.azurerm_key_vault_access_policy.creator_access_policy
  * module.key-vault.azurerm_key_vault_access_policy.developer[0]
  * module.key-vault.azurerm_key_vault_access_policy.managed_identity_access_policy[&#34;05abbb96-02f6-4611-86b3-397bfe745479&#34;]
  * module.key-vault.azurerm_key_vault_access_policy.product_team_access_policy
  * module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.app_insights_connection_string must be replaced
-/+ resource "azurerm_key_vault_secret" "app_insights_connection_string" {
      ~ id                      = "https://civil-cui-aat.vault.azure.net/secrets/appinsights-connection-string/a4ee306f96f34c69a903e4240187216e" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-aat/providers/Microsoft.KeyVault/vaults/civil-cui-aat" -> (known after apply) # forces replacement
        name                    = "appinsights-connection-string"
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-aat/providers/Microsoft.KeyVault/vaults/civil-cui-aat/secrets/appinsights-connection-string/versions/a4ee306f96f34c69a903e4240187216e" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-aat/providers/Microsoft.KeyVault/vaults/civil-cui-aat/secrets/appinsights-connection-string" -> (known after apply)
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/civil-citizen-ui.git"
            "application"         = "civil"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#civil_contact"
            "environment"         = "staging"
            "managedBy"           = "Civil"
            "source"              = "appinsights civil-citizen-ui-aat"
        }
      ~ version                 = "a4ee306f96f34c69a903e4240187216e" -> (known after apply)
      ~ versionless_id          = "https://civil-cui-aat.vault.azure.net/secrets/appinsights-connection-string" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.app_insights_instrumentation_key must be replaced
-/+ resource "azurerm_key_vault_secret" "app_insights_instrumentation_key" {
      ~ id                      = "https://civil-cui-aat.vault.azure.net/secrets/appinsights-instrumentation-key/2820b5ee466c4353afea5073677db384" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-aat/providers/Microsoft.KeyVault/vaults/civil-cui-aat" -> (known after apply) # forces replacement
        name                    = "appinsights-instrumentation-key"
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-aat/providers/Microsoft.KeyVault/vaults/civil-cui-aat/secrets/appinsights-instrumentation-key/versions/2820b5ee466c4353afea5073677db384" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-aat/providers/Microsoft.KeyVault/vaults/civil-cui-aat/secrets/appinsights-instrumentation-key" -> (known after apply)
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/civil-citizen-ui.git"
            "application"         = "civil"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#civil_contact"
            "environment"         = "staging"
            "managedBy"           = "Civil"
            "source"              = "appinsights civil-citizen-ui-aat"
        }
      ~ version                 = "2820b5ee466c4353afea5073677db384" -> (known after apply)
      ~ versionless_id          = "https://civil-cui-aat.vault.azure.net/secrets/appinsights-instrumentation-key" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.civil_secrets["citizen-ui-idam-secret"] must be replaced
-/+ resource "azurerm_key_vault_secret" "civil_secrets" {
      ~ id                      = "https://civil-cui-aat.vault.azure.net/secrets/citizen-ui-idam-secret/7aad1102b5df4a428d492d5908e9d52e" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-aat/providers/Microsoft.KeyVault/vaults/civil-cui-aat" -> (known after apply) # forces replacement
        name                    = "citizen-ui-idam-secret"
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-aat/providers/Microsoft.KeyVault/vaults/civil-cui-aat/secrets/citizen-ui-idam-secret/versions/7aad1102b5df4a428d492d5908e9d52e" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-aat/providers/Microsoft.KeyVault/vaults/civil-cui-aat/secrets/citizen-ui-idam-secret" -> (known after apply)
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/civil-citizen-ui.git"
            "application"         = "civil"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#civil_contact"
            "environment"         = "staging"
            "managedBy"           = "Civil"
            "source"              = "Key Vault civil-aat"
        }
      ~ version                 = "7aad1102b5df4a428d492d5908e9d52e" -> (known after apply)
      ~ versionless_id          = "https://civil-cui-aat.vault.azure.net/secrets/citizen-ui-idam-secret" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.civil_secrets["civil-citizen-ui-token-key"] will be destroyed
  # (because key ["civil-citizen-ui-token-key"] is not in for_each map)
  - resource "azurerm_key_vault_secret" "civil_secrets" {
      - content_type            = "secret" -> null
      - id                      = "https://civil-cui-aat.vault.azure.net/secrets/civil-citizen-ui-token-key/c30631e2daed4015ab59982a19476a10" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-aat/providers/Microsoft.KeyVault/vaults/civil-cui-aat" -> null
      - name                    = "civil-citizen-ui-token-key" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-aat/providers/Microsoft.KeyVault/vaults/civil-cui-aat/secrets/civil-citizen-ui-token-key/versions/c30631e2daed4015ab59982a19476a10" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-aat/providers/Microsoft.KeyVault/vaults/civil-cui-aat/secrets/civil-citizen-ui-token-key" -> null
      - tags                    = {
          - "BuiltFrom"           = "https://github.com/HMCTS/civil-citizen-ui.git"
          - "application"         = "civil"
          - "businessArea"        = "CFT"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#civil_contact"
          - "environment"         = "staging"
          - "managedBy"           = "Civil"
          - "source"              = "Key Vault civil-aat"
        } -> null
      - value                   = (sensitive value)
      - version                 = "c30631e2daed4015ab59982a19476a10" -> null
      - versionless_id          = "https://civil-cui-aat.vault.azure.net/secrets/civil-citizen-ui-token-key" -> null
    }

  # azurerm_key_vault_secret.civil_secrets["ordnance-survey-api-key"] must be replaced
-/+ resource "azurerm_key_vault_secret" "civil_secrets" {
      ~ id                      = "https://civil-cui-aat.vault.azure.net/secrets/ordnance-survey-api-key/4192bf94df134a76a4f7ff7109a76699" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-aat/providers/Microsoft.KeyVault/vaults/civil-cui-aat" -> (known after apply) # forces replacement
        name                    = "ordnance-survey-api-key"
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-aat/providers/Microsoft.KeyVault/vaults/civil-cui-aat/secrets/ordnance-survey-api-key/versions/4192bf94df134a76a4f7ff7109a76699" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-aat/providers/Microsoft.KeyVault/vaults/civil-cui-aat/secrets/ordnance-survey-api-key" -> (known after apply)
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/civil-citizen-ui.git"
            "application"         = "civil"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#civil_contact"
            "environment"         = "staging"
            "managedBy"           = "Civil"
            "source"              = "Key Vault civil-aat"
        }
      ~ version                 = "4192bf94df134a76a4f7ff7109a76699" -> (known after apply)
      ~ versionless_id          = "https://civil-cui-aat.vault.azure.net/secrets/ordnance-survey-api-key" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.cmc_secrets["citizen-draft-store-primary"] must be replaced
-/+ resource "azurerm_key_vault_secret" "cmc_secrets" {
      ~ id                      = "https://civil-cui-aat.vault.azure.net/secrets/citizen-draft-store-primary/49830e0400b4410ba1b2c824f24b8f89" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-aat/providers/Microsoft.KeyVault/vaults/civil-cui-aat" -> (known after apply) # forces replacement
        name                    = "citizen-draft-store-primary"
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-aat/providers/Microsoft.KeyVault/vaults/civil-cui-aat/secrets/citizen-draft-store-primary/versions/49830e0400b4410ba1b2c824f24b8f89" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-aat/providers/Microsoft.KeyVault/vaults/civil-cui-aat/secrets/citizen-draft-store-primary" -> (known after apply)
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/civil-citizen-ui.git"
            "application"         = "civil"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#civil_contact"
            "environment"         = "staging"
            "managedBy"           = "Civil"
            "source"              = "Key Vault cmc-aat"
        }
      ~ version                 = "49830e0400b4410ba1b2c824f24b8f89" -> (known after apply)
      ~ versionless_id          = "https://civil-cui-aat.vault.azure.net/secrets/citizen-draft-store-primary" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.cmc_secrets["citizen-draft-store-secondary"] must be replaced
-/+ resource "azurerm_key_vault_secret" "cmc_secrets" {
      ~ id                      = "https://civil-cui-aat.vault.azure.net/secrets/citizen-draft-store-secondary/e92dd778f8344f4ca6462e8ba05c5f00" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-aat/providers/Microsoft.KeyVault/vaults/civil-cui-aat" -> (known after apply) # forces replacement
        name                    = "citizen-draft-store-secondary"
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-aat/providers/Microsoft.KeyVault/vaults/civil-cui-aat/secrets/citizen-draft-store-secondary/versions/e92dd778f8344f4ca6462e8ba05c5f00" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-aat/providers/Microsoft.KeyVault/vaults/civil-cui-aat/secrets/citizen-draft-store-secondary" -> (known after apply)
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/civil-citizen-ui.git"
            "application"         = "civil"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#civil_contact"
            "environment"         = "staging"
            "managedBy"           = "Civil"
            "source"              = "Key Vault cmc-aat"
        }
      ~ version                 = "e92dd778f8344f4ca6462e8ba05c5f00" -> (known after apply)
      ~ versionless_id          = "https://civil-cui-aat.vault.azure.net/secrets/citizen-draft-store-secondary" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.cmc_secrets["cmc-s2s-secret"] must be replaced
-/+ resource "azurerm_key_vault_secret" "cmc_secrets" {
      ~ id                      = "https://civil-cui-aat.vault.azure.net/secrets/cmc-s2s-secret/0340c1ab88654c42a5f7a9c101e03250" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-aat/providers/Microsoft.KeyVault/vaults/civil-cui-aat" -> (known after apply) # forces replacement
        name                    = "cmc-s2s-secret"
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-aat/providers/Microsoft.KeyVault/vaults/civil-cui-aat/secrets/cmc-s2s-secret/versions/0340c1ab88654c42a5f7a9c101e03250" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-aat/providers/Microsoft.KeyVault/vaults/civil-cui-aat/secrets/cmc-s2s-secret" -> (known after apply)
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/civil-citizen-ui.git"
            "application"         = "civil"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#civil_contact"
            "environment"         = "staging"
            "managedBy"           = "Civil"
            "source"              = "Key Vault cmc-aat"
        }
      ~ version                 = "0340c1ab88654c42a5f7a9c101e03250" -> (known after apply)
      ~ versionless_id          = "https://civil-cui-aat.vault.azure.net/secrets/cmc-s2s-secret" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.redis_draft_store_access_key must be replaced
-/+ resource "azurerm_key_vault_secret" "redis_draft_store_access_key" {
      ~ id                      = "https://civil-cui-aat.vault.azure.net/secrets/draft-store-access-key/2e9a2546fd284f6eb75e64f794940845" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-aat/providers/Microsoft.KeyVault/vaults/civil-cui-aat" -> (known after apply) # forces replacement
        name                    = "draft-store-access-key"
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-aat/providers/Microsoft.KeyVault/vaults/civil-cui-aat/secrets/draft-store-access-key/versions/2e9a2546fd284f6eb75e64f794940845" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-aat/providers/Microsoft.KeyVault/vaults/civil-cui-aat/secrets/draft-store-access-key" -> (known after apply)
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/civil-citizen-ui.git"
            "application"         = "civil"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#civil_contact"
            "environment"         = "staging"
            "managedBy"           = "Civil"
            "source"              = "redis civil-citizen-ui-draft-store-aat.redis.cache.windows.net"
        }
      ~ version                 = "2e9a2546fd284f6eb75e64f794940845" -> (known after apply)
      ~ versionless_id          = "https://civil-cui-aat.vault.azure.net/secrets/draft-store-access-key" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.key-vault.azurerm_key_vault.kv must be replaced
-/+ resource "azurerm_key_vault" "kv" {
      ~ access_policy                   = [
          - {
              - application_id          = ""
              - certificate_permissions = [
                  - "Get",
                  - "List",
                ]
              - key_permissions         = [
                  - "Get",
                  - "List",
                ]
              - object_id               = "05abbb96-02f6-4611-86b3-397bfe745479"
              - secret_permissions      = [
                  - "Get",
                  - "List",
                ]
              - storage_permissions     = []
              - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          - {
              - application_id          = ""
              - certificate_permissions = [
                  - "List",
                  - "Update",
                  - "Create",
                  - "Import",
                  - "Delete",
                  - "ManageContacts",
                  - "ManageIssuers",
                  - "GetIssuers",
                  - "ListIssuers",
                  - "SetIssuers",
                  - "DeleteIssuers",
                  - "Recover",
                ]
              - key_permissions         = [
                  - "List",
                  - "Update",
                  - "Create",
                  - "Import",
                  - "Delete",
                  - "Recover",
                ]
              - object_id               = "ca5067a5-f554-4f6a-9eda-e93a1190d7ec"
              - secret_permissions      = [
                  - "List",
                  - "Set",
                  - "Delete",
                  - "Recover",
                ]
              - storage_permissions     = []
              - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          - {
              - application_id          = ""
              - certificate_permissions = [
                  - "Get",
                  - "List",
                ]
              - key_permissions         = [
                  - "Get",
                  - "List",
                ]
              - object_id               = "b2a1773c-a5ae-48b5-b5fa-95b0e05eee05"
              - secret_permissions      = [
                  - "Get",
                  - "List",
                ]
              - storage_permissions     = []
              - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          - {
              - application_id          = ""
              - certificate_permissions = [
                  - "Create",
                  - "Delete",
                  - "DeleteIssuers",
                  - "Get",
                  - "GetIssuers",
                  - "Import",
                  - "List",
                  - "ListIssuers",
                  - "SetIssuers",
                  - "Update",
                  - "ManageContacts",
                  - "ManageIssuers",
                ]
              - key_permissions         = [
                  - "Create",
                  - "List",
                  - "Get",
                  - "Delete",
                  - "Update",
                  - "Import",
                  - "Backup",
                  - "Restore",
                  - "Decrypt",
                  - "Encrypt",
                  - "UnwrapKey",
                  - "WrapKey",
                  - "Sign",
                  - "Verify",
                  - "GetRotationPolicy",
                ]
              - object_id               = "ca6d5085-485a-417d-8480-c3cefa29df31"
              - secret_permissions      = [
                  - "Set",
                  - "List",
                  - "Get",
                  - "Delete",
                  - "Recover",
                  - "Purge",
                ]
              - storage_permissions     = []
              - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
        ] -> (known after apply)
      - enable_rbac_authorization       = false -> null
      ~ id                              = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-aat/providers/Microsoft.KeyVault/vaults/civil-cui-aat" -> (known after apply)
      ~ name                            = "civil-cui-aat" -> "civil-citizen-ui-aat" # forces replacement
        tags                            = {
            "BuiltFrom"           = "https://github.com/HMCTS/civil-citizen-ui.git"
            "application"         = "civil"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#civil_contact"
            "environment"         = "staging"
            "managedBy"           = "Civil"
        }
      ~ vault_uri                       = "https://civil-cui-aat.vault.azure.net/" -> (known after apply)
        # (10 unchanged attributes hidden)

      ~ network_acls {
          - ip_rules                   = [] -> null
          - virtual_network_subnet_ids = [] -> null
            # (2 unchanged attributes hidden)
        }
    }

  # module.key-vault.azurerm_key_vault_access_policy.creator_access_policy must be replaced
-/+ resource "azurerm_key_vault_access_policy" "creator_access_policy" {
      ~ id                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-aat/providers/Microsoft.KeyVault/vaults/civil-cui-aat/objectId/ca6d5085-485a-417d-8480-c3cefa29df31" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-aat/providers/Microsoft.KeyVault/vaults/civil-cui-aat" -> (known after apply) # forces replacement
      - storage_permissions     = [] -> null
        # (5 unchanged attributes hidden)
    }

  # module.key-vault.azurerm_key_vault_access_policy.developer[0] must be replaced
-/+ resource "azurerm_key_vault_access_policy" "developer" {
      ~ id                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-aat/providers/Microsoft.KeyVault/vaults/civil-cui-aat/objectId/b2a1773c-a5ae-48b5-b5fa-95b0e05eee05" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-aat/providers/Microsoft.KeyVault/vaults/civil-cui-aat" -> (known after apply) # forces replacement
      - storage_permissions     = [] -> null
        # (5 unchanged attributes hidden)
    }

  # module.key-vault.azurerm_key_vault_access_policy.managed_identity_access_policy["05abbb96-02f6-4611-86b3-397bfe745479"] must be replaced
-/+ resource "azurerm_key_vault_access_policy" "managed_identity_access_policy" {
      ~ id                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-aat/providers/Microsoft.KeyVault/vaults/civil-cui-aat/objectId/05abbb96-02f6-4611-86b3-397bfe745479" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-aat/providers/Microsoft.KeyVault/vaults/civil-cui-aat" -> (known after apply) # forces replacement
      - storage_permissions     = [] -> null
        # (5 unchanged attributes hidden)
    }

  # module.key-vault.azurerm_key_vault_access_policy.product_team_access_policy must be replaced
-/+ resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
      ~ id                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-aat/providers/Microsoft.KeyVault/vaults/civil-cui-aat/objectId/ca5067a5-f554-4f6a-9eda-e93a1190d7ec" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-aat/providers/Microsoft.KeyVault/vaults/civil-cui-aat" -> (known after apply) # forces replacement
      - storage_permissions     = [] -> null
        # (5 unchanged attributes hidden)
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds must be replaced
-/+ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
      ~ id                             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-aat/providers/Microsoft.KeyVault/vaults/civil-cui-aat|civil-cui-aat" -> (known after apply)
      + log_analytics_destination_type = "AzureDiagnostics"
      ~ name                           = "civil-cui-aat" -> "civil-citizen-ui-aat" # forces replacement
      ~ target_resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-aat/providers/Microsoft.KeyVault/vaults/civil-cui-aat" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + log {
          + category       = (known after apply)
          + category_group = (known after apply)
          + enabled        = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 14 to add, 0 to change, 15 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1905,"Program":"tfcmt","SHA1":"","Vars":{}} -->